<a href="https://colab.research.google.com/github/DenShum/NumPy-pandas-MPL/blob/main/pal_8_Denis_Shum_dz2_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [ ]:
import pandas as pd #  Forrest Gump (1994)
data = pd.read_csv('ratings.csv')
data[data.rating == 5] #отфильтровали по рейтингу
data['movieId'].value_counts().head(100)

356     329
318     317
296     307
593     279
2571    278
       ...
5989    115
587     115
208     115
1968    113
5418    112
Name: movieId, Length: 100, dtype: int64

In [ ]:
data_mov = pd.read_csv('movies.csv')
filter_mov = data_mov[(data_mov['movieId'] == 356)]
filter_mov

     movieId                title                    genres
314      356  Forrest Gump (1994)  Comedy|Drama|Romance|War

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [ ]:
data_power = pd.read_csv('power.csv')
# filt = data_power[(data_power['category'] == 12)] #распределение стран в зависимости от категории
# filt['country'].unique()

In [ ]:
filter_country = data_power[(data_power['country'].str.contains('lit', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']==4))
|(data_power['country'].str.contains('lit', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']==12))
|(data_power['country'].str.contains('lit', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']==21))
|(data_power['country'].str.contains('lat', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>4))
|(data_power['country'].str.contains('lat', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>12))
|(data_power['country'].str.contains('lat', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>21))
|(data_power['country'].str.contains('eston', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>12))
|(data_power['country'].str.contains('eston', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>21))
|(data_power['country'].str.contains('eston', case=False)&(data_power['year']<=2010) & (data_power['year']>=2005)&(data_power['category']>4))]
res = filter_country[filter_country.quantity > 0]
result_ = res['quantity'].sum()
result_

18441005.073344536

In [ ]:
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):

In [ ]:
pd.read_html('https://www.fontanka.ru/currency.html')[0]